25-rails-sess-cookies/app/controllers/application_controller.rb

  def display_cart
    @cart_nachos = Nacho.find(cart)
---
SELECT  "nachos".* FROM "nachos" WHERE "nachos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]